"use strict";

// 1

let admin, name; // объявление двух переменных

name = "Джон"; // запись строки "Джон" в переменную name

admin = name; // копирование значения из переменной name в переменную admin

alert(admin); // вывод значения переменной admin в окно браузера

// 2

let planetName = "Земля";

let currentUserName = "Джон";

// 3

//Да, можно использовать заглавные буквы для имени переменной birthday и/или для переменной age. В языке программирования обычно регистр букв в именах переменных имеет значение, и использование заглавных букв является общепринятой практикой для обозначения констант или глобальных переменных.

//Обычно следует использовать заглавные буквы только для имени константы, если она определена как таковая. Для переменной age, если её значение меняется в ходе выполнения программы, то обычно используются строчные буквы. Однако, если переменная age также является константой, то можно использовать заглавные буквы для её имени.